title: Find SUID/SGID Files Scan
id: f9a0b1c2-3e47-4f5u-7890-666677778888
description: Detects commands that search for SUID/SGID files (find / -perm -4000 -type f).
status: experimental
author: shresth paul
date: 2025-10-07
logsource:
  product: linux
  service: syslog
detection:
  selection:
    Message|contains: 'find / -perm -4000 -type f'
  condition: selection
fields:
  - Message
level: medium
tags:
  - attack.discovery
falsepositives:
  - Security audits looking for SUID files
